import random

def update_hint(guess, idiom, hint):
    for i in range(len(idiom)):
        if guess == idiom[i]:
            hint[i] = guess

live = 20
heart = u'\u2764'
hint = ['?','?','?','?']
result = False

words = idioms = [
    "가렴주구", "각골난망", "갑론을박", "견강부회", "격물치지",
    "결초보은", "경국지색", "계구우후", "고군분투", "고진감래",
    "공명정대", "과유불급", "괄목상대", "권선징악", "기사회생",
    "기우일소", "난형난제", "노심초사", "다다익선", "단도직입",
    "대기만성", "대동소이", "대사난망", "독서삼매", "동문서답",
    "동분서주", "동상이몽", "두문불출", "등용문", "마이동풍",
    "막상막하", "맹모삼천", "무용지물", "문일지십", "면목일신",
    "반신반의", "백년대계", "백발백중", "부화뇌동", "불가사의",
    "사면초가", "사필귀정", "삼고초려", "삼순구식", "새옹지마",
    "생사고락", "설상가상", "소탐대실", "수심동체", "시시비비",
    "식견만리", "십년감수", "십시일반", "안빈낙도", "안전제일",
    "약육강식", "양두구육", "어부지리", "어불성설", "언중유골",
    "역지사지", "연목구어", "오리무중", "오월동주", "와신상담",
    "외유내강", "용두사미", "우이독경", "우후죽순", "유비무환",
    "유유상종", "윤화위위", "이심전심", "인과응보", "일벌백계",
    "일취월장", "일편단심", "임기응변", "자업자득", "자포자기",
    "작심삼일", "적반하장", "전전긍긍", "전화위복", "점입가경",
    "제제상종", "조삼모사", "조석변화", "주경야독", "중구난방",
    "지록위마", "천고명월", "천재일우", "천하무적", "청출어람",
    "초록동색", "촌철살인", "풍수지탄", "학수고대", "호사다마"
]
idiom = random.choice(words)

while live>-1:
    if live == 0:
        print(f"정답은 {idiom}이었습니다")
        break
    print(hint)
    print('남은 생명 : '+ heart*live)
    guess = input('사자성어를 맞춰보세요 : ')
    

    if guess == idiom:
        result = True
        print("정답입니다!")
        break

    if guess in idiom:
        update_hint(guess, idiom, hint)
        print()

    else:
        ('땡! 생명이 줄어들었습니다.')
        live -= 1